app/views/results/index.html.erb


    <% Entry.all.each do |entry| %>
      <%  @score = 0 %>
      <% if entry[:Best_Picture] == Result.first[:Best_Picture] then @score += 1 %>
      <% end %>
      <% if entry[:Actor_Leading] == Result.first[:Actor_Leading] then @score += 1 %>
      <% end %>
      <% if entry[:Actress_Leading] == Result.first[:Actress_Leading] then @score += 1 %>
      <% end %>
      <% if entry[:Actor_Supporting] == Result.first[:Actor_Supporting] then @score += 1 %>
      <% end %>
      <% if entry[:Actress_Supporting] == Result.first[:Actress_Supporting] then @score += 1 %>
      <% end %>
      <% if entry[:Animated_Film] == Result.first[:Animated_Film] then @score += 1 %>
      <% end %>
      <% if entry[:Cinematography] == Result.first[:Cinematography] then @score += 1 %>
      <% end %>
      <% if entry[:Costume_Design] == Result.first[:Costume_Design] then @score += 1 %>
      <% end %>
      <% if entry[:Director] == Result.first[:Director] then @score += 1 %>
      <% end %>
      <% if entry[:Documentary] == Result.first[:Documentary] then @score += 1 %>
      <% end %>
      <% if entry[:Documentary_Short] == Result.first[:Documentary_Short] then @score += 1 %>
      <% end %>
      <% if entry[:Film_Editing] == Result.first[:Film_Editing] then @score += 1 %>
      <% end %>
      <% if entry[:Foreign_Film] == Result.first[:Foreign_Film] then @score += 1 %>
      <% end %>
      <% if entry[:Makeup_Hair] == Result.first[:Makeup_Hair] then @score += 1 %>
      <% end %>
      <% if entry[:Original_Score] == Result.first[:Original_Score] then @score += 1 %>
      <% end %>
      <% if entry[:Original_Song] == Result.first[:Original_Song] then @score += 1 %>
      <% end %>
      <% if entry[:Production_Design] == Result.first[:Production_Design] then @score += 1 %>
      <% end %>
      <% if entry[:Animated_Short_Film] == Result.first[:Animated_Short_Film] then @score += 1 %>
      <% end %>
      <% if entry[:Short_Film] == Result.first[:Short_Film] then @score += 1 %>
      <% end %>
      <% if entry[:Sound_Editing] == Result.first[:Sound_Editing] then @score += 1 %>
      <% end %>
      <% if entry[:Sound_Mixing] == Result.first[:Sound_Mixing] then @score += 1 %>
      <% end %>
      <% if entry[:Visual_Effects] == Result.first[:Visual_Effects] then @score += 1 %>
      <% end %>
      <% if entry[:Adapted_Screenplay] == Result.first[:Adapted_Screenplay] then @score += 1 %>
      <% end %>
      <% if entry[:Original_Screenplay] == Result.first[:Original_Screenplay] then @score += 1 %>
---
SELECT "entries".* FROM "entries"
SELECT  "results".* FROM "results" ORDER BY "results"."id" ASC LIMIT $1  [["LIMIT", 1]]