app/views/results/index.html.erb

SELECT  "ballots".* FROM "ballots"  ORDER BY "ballots"."id" ASC LIMIT 1
---

    <% Ballot.all.each do |ballot| %>