app/controllers/ballots_controller.rb

  def index
    @ballots = Ballot.all
---
SELECT "ballots".* FROM "ballots"

  def create
    @ballot = Ballot.new(ballot_params)

    respond_to do |format|
      if @ballot.save
---
INSERT INTO "ballots" ("Name", "Score", "Best_Picture", "Actor_Leading", "Actress_Leading", "Actor_Supporting", "Actress_Supporting", "Animated_Film", "Cinematography", "Costume_Design", "Director", "Documentary", "Documentary_Short", "Film_Editing", "Foreign_Film", "Makeup_Hair", "Original_Score", "Original_Song", "Production_Design", "Animated_Short_Film", "Short_Film", "Sound_Editing", "Sound_Mixing", "Visual_Effects", "Adapted_Screenplay", "Original_Screenplay", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20, $21, $22, $23, $24, $25, $26, $27, $28) RETURNING "id"

  def destroy
    @ballot.destroy
---
DELETE FROM "ballots" WHERE "ballots"."id" = ?  [["id", 980190962]]

    def set_ballot
      @ballot = Ballot.find(params[:id])
---
SELECT  "ballots".* FROM "ballots" WHERE "ballots"."id" = ? LIMIT 1  [["id", 980190962]]