app/controllers/entries_controller.rb

  def index
    @entries = Entry.all
---
SELECT "entries".* FROM "entries"

  def create
    @entry = Entry.new(entry_params)

    respond_to do |format|
      if @entry.save
---
INSERT INTO "entries" ("Name", "Best_Picture", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["Name", ""], ["Best_Picture", "Lady Bird"], ["created_at", "2018-12-03 22:14:23.563728"], ["updated_at", "2018-12-03 22:14:23.563728"]]

  def destroy
    @entry.destroy
---
DELETE FROM "entries" WHERE "entries"."id" = $1  [["id", 980190962]]

    def set_entry
      @entry = Entry.find(params[:id])
---
SELECT  "entries".* FROM "entries" WHERE "entries"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]