app/controllers/games_controller.rb

INSERT INTO "games" ("GameName", "CreatedBy", "Numberofplayers", "PublicorPrivate", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["GameName", "MyString"], ["CreatedBy", "MyString"], ["Numberofplayers", 1], ["PublicorPrivate", "f"], ["created_at", "2016-03-19 15:57:08.869770"], ["updated_at", "2016-03-19 15:57:08.869770"]]
---
  def create
    @game = Game.new(game_params)

    respond_to do |format|
      if @game.save

DELETE FROM "games" WHERE "games"."id" = $1  [["id", 980190962]]
---
  def destroy
    @game.destroy