app/controllers/results_controller.rb

  def index
    @results = Result.all
    @ballots = Ballot.order(params[:sort])
---
SELECT  "results".* FROM "results"  ORDER BY "results"."id" ASC LIMIT 1
SELECT  "ballots".* FROM "ballots"  ORDER BY "ballots"."id" ASC LIMIT 1

  def create
    @result = Result.new(result_params)

    respond_to do |format|
      if @result.save
---
INSERT INTO "results" ("Name", "Best_Picture", "Actor_Leading", "Actress_Leading", "Actor_Supporting", "Actress_Supporting", "Animated_Film", "Cinematography", "Costume_Design", "Director", "Documentary", "Documentary_Short", "Film_Editing", "Foreign_Film", "Makeup_Hair", "Original_Score", "Original_Song", "Production_Design", "Animated_Short_Film", "Short_Film", "Sound_Editing", "Sound_Mixing", "Visual_Effects", "Adapted_Screenplay", "Original_Screenplay", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20, $21, $22, $23, $24, $25, $26, $27) RETURNING "id"

  def destroy
    @result.destroy
---
DELETE FROM "results" WHERE "results"."id" = ?  [["id", 980190962]]

    def set_result
      @result = Result.find(params[:id])
---
SELECT  "results".* FROM "results" WHERE "results"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]